[
   {
      "bookId": "A1b2C3d4E5F6",
      "bookName": "The Enigma of Blackwood Manor",
      "author": "Margaret Atwood",
      "image": "https://i.ibb.co/XbswyKZ/book-1.png",
      "review": "A captivating tale of mystery and suspense that keeps you on the edge of your seat. The story unfolds in the eerie Blackwood Manor, where secrets from the past come to light in the most unexpected ways. Atwood masterfully weaves a plot full of twists and turns, keeping readers guessing until the very last page. The characters are well-developed, and the atmosphere is palpably tense, making this book a must-read for fans of gothic fiction.",
      "totalPages": 320,
      "rating": 4.5,
      "category": "Mystery",
      "tags": ["Suspense", "Thriller"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 2019
   },
   {
      "bookId": "G7h8I9J0k1L2",
      "bookName": "The Quantum Prophecy",
      "author": "Neil Gaiman",
      "image": "https://i.ibb.co/9swmgWF/book-2.png",
      "review": "An intriguing dive into the world of quantum physics, wrapped in a thrilling narrative. Gaiman presents complex scientific concepts in an accessible and entertaining way, making this book a perfect blend of science fiction and adventure. The plot revolves around a scientist's discovery that could change the course of humanity, and the ensuing race against time to control this powerful knowledge. Gaiman's signature style of blending the fantastical with the real world makes 'The Quantum Prophecy' an exhilarating read.",
      "totalPages": 290,
      "rating": 4.2,
      "category": "Science Fiction",
      "tags": ["Quantum Physics", "Adventure"],
      "publisher": "Penguin Books",
      "yearOfPublishing": 2021
   },
   {
      "bookId": "M3n4O5P6q7R8S",
      "bookName": "Whispers of the Past",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/0MJY9vd/book-3.png",
      "review": "A beautiful exploration of love, loss, and the echoes of history. Set against the backdrop of a quaint English village, this novel captures the essence of Austen's writing—sharp wit, keen social commentary, and a deep understanding of human emotions. The story follows the lives of two families as they navigate the challenges of their time, with a particular focus on the women who, despite societal constraints, find their own paths to happiness. 'Whispers of the Past' is a poignant reminder of the enduring power of love and resilience.",
      "totalPages": 280,
      "rating": 4.8,
      "category": "Historical Fiction",
      "tags": ["Romance", "Drama"],
      "publisher": "Vintage",
      "yearOfPublishing": 2018
   },
   {
      "bookId": "T9u0V1W2x3Y4Z",
      "bookName": "The Art of War",
      "author": "Sun Tzu",
      "image": "https://i.ibb.co/hRHZ3Zh/book-4.png",
      "review": "A timeless classic offering profound insights into strategy and leadership. Sun Tzu's teachings are as relevant today as they were thousands of years ago, applicable not just to warfare but to all areas of life where strategy and tactical thinking are needed. The text is filled with aphorisms that have inspired countless leaders in various fields. 'The Art of War' is not just a book, but a manual for those who seek to navigate the complexities of conflict, competition, and personal development.",
      "totalPages": 200,
      "rating": 4.9,
      "category": "Philosophy",
      "tags": ["Strategy", "Leadership"],
      "publisher": "Oxford University Press",
      "yearOfPublishing": 2020
   },
   {
      "bookId": "A5b6C7D8e9F0G1",
      "bookName": "The Last Light",
      "author": "Stephen King",
      "image": "https://i.ibb.co/JskS04T/book-5.png",
      "review": "A gripping horror story that will haunt your dreams long after you finish reading. Stephen King once again proves his mastery of the horror genre with 'The Last Light,' a novel that delves into the darkest corners of the human mind. The story is set in a small town plagued by a series of inexplicable events that leave the townspeople in a state of constant fear. As the mystery unfolds, the protagonist must confront not only the external horrors but also the inner demons that have haunted them for years. King's vivid descriptions and compelling characters make this a terrifying yet utterly compelling read.",
      "totalPages": 450,
      "rating": 4.6,
      "category": "Horror",
      "tags": ["Dark", "Psychological"],
      "publisher": "Scribner",
      "yearOfPublishing": 2017
   },
   {
      "bookId": "H2i3J4k5L6M7N8",
      "bookName": "Echoes of Eternity",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/k32FByV/book-6.png",
      "review": "A mesmerizing fantasy journey through a world filled with magic and wonder. Tolkien's 'Echoes of Eternity' takes readers on an epic adventure through lands of myth and legend, where heroes rise and fall, and the fate of entire realms hangs in the balance. The richly detailed world-building, combined with a cast of unforgettable characters, makes this book a must-read for fans of the fantasy genre. Tolkien's prose is both lyrical and powerful, drawing readers into a story that is as timeless as it is enthralling.",
      "totalPages": 500,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Epic", "Adventure"],
      "publisher": "Houghton Mifflin Harcourt",
      "yearOfPublishing": 2016
   },
   {
      "bookId": "O9p0Q1R2s3T4U5",
      "bookName": "The Digital Fortress",
      "author": "Dan Brown",
      "image": "https://i.ibb.co/q11cWNy/book-7.png",
      "review": "A fast-paced techno-thriller that explores the dangers of digital security. Dan Brown crafts a suspenseful narrative that delves into the complexities of cryptography and the ethical dilemmas of privacy in the digital age. The protagonist, a brilliant cryptographer, is thrust into a world of secrecy and betrayal as they race to uncover the truth behind a mysterious code that could compromise global security. With its blend of real-world technology and fictional intrigue, 'The Digital Fortress' is a thrilling read that will keep you hooked from start to finish.",
      "totalPages": 350,
      "rating": 4.3,
      "category": "Thriller",
      "tags": ["Technology", "Cybersecurity"],
      "publisher": "Random House",
      "yearOfPublishing": 2019
   },
   {
      "bookId": "V6w7X8y9Z0A1B2",
      "bookName": "The Silent Patient",
      "author": "Alex Michaelides",
      "image": "https://i.ibb.co/6sGndYb/book-8.png",
      "review": "A psychological thriller that keeps you guessing until the very end. 'The Silent Patient' tells the story of a famous painter who shoots her husband and then stops speaking entirely. The twist-filled narrative unfolds as a criminal psychologist becomes obsessed with uncovering the truth behind her silence. Michaelides expertly builds tension, creating a gripping tale of psychological manipulation, secrets, and the dark side of human nature. The ending is as shocking as it is satisfying, making this book a standout in the genre.",
      "totalPages": 340,
      "rating": 4.7,
      "category": "Psychological Thriller",
      "tags": ["Mystery", "Suspense"],
      "publisher": "Celadon Books",
      "yearOfPublishing": 2018
   },
   {
      "bookId": "C3d4E5f6G7H8I9J0",
      "bookName": "The Road Less Traveled",
      "author": "M. Scott Peck",
      "image": "https://i.ibb.co/J5Gbh68/book-9.png",
      "review": "A profound exploration of personal growth and spiritual development. In 'The Road Less Traveled,' M. Scott Peck offers readers a guide to understanding the complexities of human psychology and the journey toward spiritual enlightenment. The book is divided into three sections: discipline, love, and growth, each offering deep insights into the challenges and rewards of leading a fulfilling life. Peck's wisdom and compassion shine through in his writing, making this book a timeless resource for anyone seeking to better understand themselves and the world around them.",
      "totalPages": 240,
      "rating": 4.8,
      "category": "Self-help",
      "tags": ["Personal Growth", "Spirituality"],
      "publisher": "Simon & Schuster",
      "yearOfPublishing": 2020
   }
]
